app/controllers/lists_controller.rb

SELECT "lists".* FROM "lists"
---
  def index
    @list = List.new
    @lists = List.all

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    # params has all the data passed by a user
    # lists/:id - reading from URL
    @list = List.find(params[:id])